load/results/20260504-221512-smoke/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/paymei/Documents/Development/github/meyouquize/load/k6-http.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 15/15 VUs, 403 complete and 0 interrupted iterations
default   [   2% ] 15 VUs  0m01.0s/1m0s

running (0m02.0s), 15/15 VUs, 866 complete and 0 interrupted iterations
default   [   3% ] 15 VUs  0m02.0s/1m0s

running (0m03.0s), 15/15 VUs, 1379 complete and 0 interrupted iterations
default   [   5% ] 15 VUs  0m03.0s/1m0s

running (0m04.0s), 15/15 VUs, 1865 complete and 0 interrupted iterations
default   [   7% ] 15 VUs  0m04.0s/1m0s

running (0m05.0s), 15/15 VUs, 2340 complete and 0 interrupted iterations
default   [   8% ] 15 VUs  0m05.0s/1m0s

running (0m06.0s), 15/15 VUs, 2890 complete and 0 interrupted iterations
default   [  10% ] 15 VUs  0m06.0s/1m0s

running (0m07.0s), 15/15 VUs, 3414 complete and 0 interrupted iterations
default   [  12% ] 15 VUs  0m07.0s/1m0s

running (0m08.0s), 15/15 VUs, 3919 complete and 0 interrupted iterations
default   [  13% ] 15 VUs  0m08.0s/1m0s

running (0m09.0s), 15/15 VUs, 4374 complete and 0 interrupted iterations
default   [  15% ] 15 VUs  0m09.0s/1m0s

running (0m10.0s), 15/15 VUs, 4872 complete and 0 interrupted iterations
default   [  17% ] 15 VUs  0m10.0s/1m0s

running (0m11.0s), 15/15 VUs, 5364 complete and 0 interrupted iterations
default   [  18% ] 15 VUs  0m11.0s/1m0s

running (0m12.0s), 15/15 VUs, 5916 complete and 0 interrupted iterations
default   [  20% ] 15 VUs  0m12.0s/1m0s

running (0m13.0s), 15/15 VUs, 6393 complete and 0 interrupted iterations
default   [  22% ] 15 VUs  0m13.0s/1m0s

running (0m14.0s), 15/15 VUs, 6855 complete and 0 interrupted iterations
default   [  23% ] 15 VUs  0m14.0s/1m0s

running (0m15.0s), 15/15 VUs, 7403 complete and 0 interrupted iterations
default   [  25% ] 15 VUs  0m15.0s/1m0s

running (0m16.0s), 15/15 VUs, 7954 complete and 0 interrupted iterations
default   [  27% ] 15 VUs  0m16.0s/1m0s

running (0m17.0s), 15/15 VUs, 8471 complete and 0 interrupted iterations
default   [  28% ] 15 VUs  0m17.0s/1m0s

running (0m18.0s), 15/15 VUs, 8965 complete and 0 interrupted iterations
default   [  30% ] 15 VUs  0m18.0s/1m0s

running (0m19.0s), 15/15 VUs, 9418 complete and 0 interrupted iterations
default   [  32% ] 15 VUs  0m19.0s/1m0s

running (0m20.0s), 15/15 VUs, 9842 complete and 0 interrupted iterations
default   [  33% ] 15 VUs  0m20.0s/1m0s

running (0m21.0s), 15/15 VUs, 10344 complete and 0 interrupted iterations
default   [  35% ] 15 VUs  0m21.0s/1m0s

running (0m22.0s), 15/15 VUs, 10799 complete and 0 interrupted iterations
default   [  37% ] 15 VUs  0m22.0s/1m0s

running (0m23.0s), 15/15 VUs, 11264 complete and 0 interrupted iterations
default   [  38% ] 15 VUs  0m23.0s/1m0s

running (0m24.0s), 15/15 VUs, 11797 complete and 0 interrupted iterations
default   [  40% ] 15 VUs  0m24.0s/1m0s

running (0m25.0s), 15/15 VUs, 12270 complete and 0 interrupted iterations
default   [  42% ] 15 VUs  0m25.0s/1m0s

running (0m26.0s), 15/15 VUs, 12764 complete and 0 interrupted iterations
default   [  43% ] 15 VUs  0m26.0s/1m0s

running (0m27.0s), 15/15 VUs, 13225 complete and 0 interrupted iterations
default   [  45% ] 15 VUs  0m27.0s/1m0s

running (0m28.0s), 15/15 VUs, 13645 complete and 0 interrupted iterations
default   [  47% ] 15 VUs  0m28.0s/1m0s

running (0m29.0s), 15/15 VUs, 14086 complete and 0 interrupted iterations
default   [  48% ] 15 VUs  0m29.0s/1m0s

running (0m30.0s), 15/15 VUs, 14532 complete and 0 interrupted iterations
default   [  50% ] 15 VUs  0m30.0s/1m0s

running (0m31.0s), 15/15 VUs, 15007 complete and 0 interrupted iterations
default   [  52% ] 15 VUs  0m31.0s/1m0s

running (0m32.0s), 15/15 VUs, 15541 complete and 0 interrupted iterations
default   [  53% ] 15 VUs  0m32.0s/1m0s

running (0m33.0s), 15/15 VUs, 16036 complete and 0 interrupted iterations
default   [  55% ] 15 VUs  0m33.0s/1m0s

running (0m34.0s), 15/15 VUs, 16478 complete and 0 interrupted iterations
default   [  57% ] 15 VUs  0m34.0s/1m0s

running (0m35.0s), 15/15 VUs, 16928 complete and 0 interrupted iterations
default   [  58% ] 15 VUs  0m35.0s/1m0s

running (0m36.0s), 15/15 VUs, 17424 complete and 0 interrupted iterations
default   [  60% ] 15 VUs  0m36.0s/1m0s

running (0m37.0s), 15/15 VUs, 17905 complete and 0 interrupted iterations
default   [  62% ] 15 VUs  0m37.0s/1m0s

running (0m38.0s), 15/15 VUs, 18407 complete and 0 interrupted iterations
default   [  63% ] 15 VUs  0m38.0s/1m0s

running (0m39.0s), 15/15 VUs, 18839 complete and 0 interrupted iterations
default   [  65% ] 15 VUs  0m39.0s/1m0s

running (0m40.0s), 15/15 VUs, 19312 complete and 0 interrupted iterations
default   [  67% ] 15 VUs  0m40.0s/1m0s

running (0m41.0s), 15/15 VUs, 19789 complete and 0 interrupted iterations
default   [  68% ] 15 VUs  0m41.0s/1m0s

running (0m42.0s), 15/15 VUs, 20286 complete and 0 interrupted iterations
default   [  70% ] 15 VUs  0m42.0s/1m0s

running (0m43.0s), 15/15 VUs, 20748 complete and 0 interrupted iterations
default   [  72% ] 15 VUs  0m43.0s/1m0s

running (0m44.0s), 15/15 VUs, 21287 complete and 0 interrupted iterations
default   [  73% ] 15 VUs  0m44.0s/1m0s

running (0m45.0s), 15/15 VUs, 21743 complete and 0 interrupted iterations
default   [  75% ] 15 VUs  0m45.0s/1m0s

running (0m46.0s), 15/15 VUs, 22218 complete and 0 interrupted iterations
default   [  77% ] 15 VUs  0m46.0s/1m0s

running (0m47.0s), 15/15 VUs, 22687 complete and 0 interrupted iterations
default   [  78% ] 15 VUs  0m47.0s/1m0s

running (0m48.0s), 15/15 VUs, 23216 complete and 0 interrupted iterations
default   [  80% ] 15 VUs  0m48.0s/1m0s

running (0m49.0s), 15/15 VUs, 23689 complete and 0 interrupted iterations
default   [  82% ] 15 VUs  0m49.0s/1m0s

running (0m50.0s), 15/15 VUs, 24159 complete and 0 interrupted iterations
default   [  83% ] 15 VUs  0m50.0s/1m0s

running (0m51.0s), 15/15 VUs, 24618 complete and 0 interrupted iterations
default   [  85% ] 15 VUs  0m51.0s/1m0s

running (0m52.0s), 15/15 VUs, 25136 complete and 0 interrupted iterations
default   [  87% ] 15 VUs  0m52.0s/1m0s

running (0m53.0s), 15/15 VUs, 25646 complete and 0 interrupted iterations
default   [  88% ] 15 VUs  0m53.0s/1m0s

running (0m54.0s), 15/15 VUs, 26172 complete and 0 interrupted iterations
default   [  90% ] 15 VUs  0m54.0s/1m0s

running (0m55.0s), 15/15 VUs, 26662 complete and 0 interrupted iterations
default   [  92% ] 15 VUs  0m55.0s/1m0s

running (0m56.0s), 15/15 VUs, 27145 complete and 0 interrupted iterations
default   [  93% ] 15 VUs  0m56.0s/1m0s

running (0m57.0s), 15/15 VUs, 27602 complete and 0 interrupted iterations
default   [  95% ] 15 VUs  0m57.0s/1m0s

running (0m58.0s), 15/15 VUs, 28114 complete and 0 interrupted iterations
default   [  97% ] 15 VUs  0m58.0s/1m0s

running (0m59.0s), 15/15 VUs, 28640 complete and 0 interrupted iterations
default   [  98% ] 15 VUs  0m59.0s/1m0s

running (1m00.0s), 15/15 VUs, 29122 complete and 0 interrupted iterations
default   [ 100% ] 15 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=19.17ms
    ✓ 'p(99)<900' p(99)=230.85ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 58274   968.554586/s
    checks_succeeded...: 100.00% 58274 out of 58274
    checks_failed......: 0.00%   0 out of 58274

    ✓ healthz:200
    ✓ readyz:200

    HTTP
    http_req_duration..............: avg=15.35ms min=5.41ms  med=10.88ms max=656.13ms p(90)=15.6ms  p(95)=19.17ms
      { expected_response:true }...: avg=15.35ms min=5.41ms  med=10.88ms max=656.13ms p(90)=15.6ms  p(95)=19.17ms
    http_req_failed................: 0.00%  0 out of 58274
    http_reqs......................: 58274  968.554586/s

    EXECUTION
    iteration_duration.............: avg=30.88ms min=11.97ms med=22.4ms  max=664.95ms p(90)=31.21ms p(95)=37.56ms
    iterations.....................: 29137  484.277293/s
    vus............................: 15     min=15         max=15
    vus_max........................: 15     min=15         max=15

    NETWORK
    data_received..................: 27 MB  452 kB/s
    data_sent......................: 2.3 MB 38 kB/s



running (1m00.2s), 00/15 VUs, 29137 complete and 0 interrupted iterations
default ✓ [ 100% ] 15 VUs  1m0s